[
  {
    "id": "ledger-page",
    "name": "The Ledger Page",
    "type": "evidence",
    "icon": "file-text",
    "summary": "Physical proof of Smith's Coster's involvement with MS-13 mindersand.",
    "details": "I have a ledger page tying Smith's Coster to MS-13 mindersand and 'increase compliance' intent notes. If it surfaces, everything changes. If it's destroyed, the proof is gone.",
    "trigger": "Someone asks about proof, or Meilin needs leverage, or Smith's Coster demands it back.",
    "escalation": "Pryce intensifies pursuit. Adjacent people become targets. The crew learns they're carrying heat."
  },
  {
    "id": "violent-reaction",
    "name": "Violent Reaction",
    "type": "vulnerability",
    "icon": "heart-pulse",
    "summary": "Mindersand affects Meilin far more violently than most people.",
    "details": "Most people exposed to mindersand fog quietly. Meilin's body tried to kill her. She's a walking early warning system and a liability in the same breath.",
    "trigger": "Exposure to contaminated food, water, or air. Someone weaponizes her sensitivity.",
    "escalation": "Medical emergency. Cover blown. Someone realizes she's useful as a detector... or a victim."
  },
  {
    "id": "pressure-points",
    "name": "Pressure Points",
    "type": "leverage",
    "icon": "crosshair",
    "summary": "Her father, Sera, and Meredin's network can all be squeezed.",
    "details": "Any pressure on Kaito, Sera Quill, or Meredin's network forces Meilin to choose between speed and safety. She'll sacrifice herself before she lets them pay for her choices.",
    "trigger": "A message arrives. An audit targets the shop. Sera is followed. Meredin goes quiet.",
    "escalation": "Meilin makes a bad trade to protect someone. The crew inherits the consequences."
  },
  {
    "id": "brothers-return",
    "name": "Brother's Return",
    "type": "complication",
    "icon": "ship",
    "summary": "Cassian can re-enter her life at any port, and his 'help' has strings.",
    "details": "Cassian can show up through a port, a ship contract, or a patron's introduction. His opportunities often come with invisible strings attached.",
    "trigger": "The party docks somewhere. A patron offers help. A letter arrives with bright words and one wrong line.",
    "escalation": "Cassian's 'favor' creates a debt. His patron has expectations. Family loyalty conflicts with crew safety."
  },
  {
    "id": "constellation-mark",
    "name": "The Mark I Can't Explain",
    "type": "origin",
    "icon": "sparkles",
    "summary": "The constellation scar on her forearm predates any accident she remembers.",
    "details": "The small cluster of micro-scars on Meilin's left forearm looks like a starfield. Her father says she had it before she could walk, but he won't say more. It's not a chemical burn from the shop. It's something older.",
    "trigger": "Someone notices the mark. A healer asks about its origin. A pattern emerges that matches the scar's shape.",
    "escalation": "The mark connects to something larger: her mother, her sensitivity to mindersand, or something waiting to be found. Kaito's silence becomes a wall she has to break."
  },
  {
    "id": "absent-mother",
    "name": "The Mother Who Wasn't There",
    "type": "secret",
    "icon": "user-x",
    "summary": "Her father never speaks of her mother. The silence is too complete to be grief.",
    "details": "No portrait, no name in the ledgers, no grave to visit. Kaito raised Meilin and Cassian alone, and he treats questions about their mother like closed wounds. Something happened, and he's protecting her from knowing what.",
    "trigger": "Someone asks about her family. A document surfaces with her mother's name. Cassian mentions something he shouldn't know.",
    "escalation": "The truth forces a reckoning: with her father's choices, her own origins, or enemies who knew her mother before Meilin existed."
  }
]
