{
  "number": "09",
  "title": "Fingers, Coin, and Shame",
  "skills": ["Sleight of Hand"],
  "cardBrief": "Meilin treats sleight of hand like a tourniquet: not for show, for control. She pickpockets a pickpocket to restore stolen goods. Calm, boring, and timed to someone else's impatience.",
  "keyTakeaways": [
    "**Quiet theft in progress**: A stall merchant is getting worked by a pickpocket during a rush, and can't accuse anyone without starting trouble.",
    "**Attention as bleeding**: Meilin treats attention like bleeding and uses sleight of hand as control, not spectacle.",
    "**Theft reversed**: She pickpockets a pickpocket, restores the stolen goods, and does it in a way that protects the merchant's reputation.",
    "**Real cost named**: She names the real cost of theft in the Bazaar: shame, noise, and targets."
  ],
  "content": "Meilin doesn't like stealing.\n\nShe likes sleight of hand the way she likes a tourniquet. Not for show. For control. For the moment when a situation starts bleeding attention.\n\nThe Bazaar tests that boundary on a night when a merchant comes to her with a problem and too much pride left to protect.\n\nIt's a stall owner named Jori, thin from long hours and stubborn habits, hands that never stop counting and never stop moving.\n\n\"I'm losing stock,\" Jori says, voice low, face set in the patient smile he sells to customers. \"Not to bad bookkeeping. Not to honest mistakes.\"\n\nHe doesn't look at her when he says it. He looks at his own display table, at the hooks of cheap trinkets and useful tools, at the little curated miracles that keep his rent paid.\n\n\"If I call it out,\" he says, \"I'm the villain. If I'm wrong, I'm worse than a villain. I'm a stall that cries wolf.\"\n\nMeilin watches the crowd instead of his face. The Astral Bazaar isn't a room. It's a current. It carries bodies, excuses, and hands that belong to people you'll never see again.\n\nShe doesn't lecture him about the Bazaar. The Bazaar doesn't learn.\n\n\"Show me how it happens,\" she says.\n\nThey stand as if they're strangers who happen to like the same merchandise. Close enough to share breath if needed, far enough to avoid becoming a story.\n\nJori's stall is a practical one. Waxed thread. Rivets. Small charms that look like luck but mostly function as debt. Little packets of spice, because the richest customers like to pretend hunger is optional.\n\nMeilin watches what people touch. She watches what they touch twice.\n\nOn the third wave of customers, she sees him.\n\nNot dramatic. Not flashy. A young man with clean sleeves and soft shoes, moving like he belongs anywhere. He pauses at the stall, laughs at something a customer says, and lets the crowd do the work of concealment.\n\nHis fingers drift. They don't grab. They settle.\n\nHe takes a small pouch of coin from under the stall lip, where Jori keeps it half hidden, half reachable. He takes it the way a nurse takes a tray, as if it was always meant to be in his hands.\n\nJori doesn't see. He's looking up at faces. He's selling calm. He's trying not to look like prey.\n\nMeilin doesn't move fast. Fast is a symptom.\n\nShe steps in like a customer with questions, because questions are a kind of wall.\n\n\"That wax,\" she says, lifting a small tin between two fingers. \"Is it animal based or resin based? I need it to hold in cold air.\"\n\nJori turns toward her, relief disguised as annoyance. \"Resin. Holds fine.\"\n\nThe pickpocket is already easing away, coin pouch nested inside his sleeve like a secret.\n\nMeilin talks anyway. She asks for a second tin, and a third, and a packet of thread. She makes Jori lift lids and list prices. She makes him use both hands.\n\nIt's not cruelty. It's medicine. She's taking his attention and applying pressure until the bleeding stops.\n\nThe pickpocket brushes past her shoulder on his way out, because that's how he leaves. Contact. Confusion. A body between witnesses and truth.\n\nMeilin lets him think he chose the path.\n\nHer left hand rises, casual, as if to steady herself against a hanging display hook. Her fingers find fabric and seam and the weight of the pouch through cloth.\n\nSleight of hand is not fast. Fast is a symptom.\n\nSleight of hand is calm, and boring, and timed to someone else's impatience.\n\nThe pickpocket's sleeve is tailored for theft. There's an inner fold meant to catch coin and keep it quiet. Meilin's thumb slips into that fold, and her fingers slide the pouch free the way she'd slide a splinter from skin.\n\nThe pickpocket keeps walking. His body doesn't react, because he expects success. He expects the world to be busy.\n\nMeilin keeps her face neutral. Neutral is a tool. It makes people underestimate your intent.\n\nShe doesn't chase him. Chasing turns private problems into public ones.\n\nInstead, she finishes being a customer.\n\nShe sets coin on the counter, counted and clean, enough for what she asked for. She waits until Jori turns to wrap the goods. Then she leans in as if she's inspecting the thread, and her left hand slips under the stall lip.\n\nIt's the same place the thief used. The same blind spot.\n\nMeilin slides the pouch back into its hiding place with a motion as ordinary as returning a tool to its hook. Not fast. Not guilty. Just exact.\n\nJori's eyes flick down for a fraction of a second. He sees the pouch. He sees that it's back. He doesn't react, because reacting would make it real to everyone else.\n\nMeilin straightens and accepts her wrapped purchases like nothing happened.\n\nOnly then does she look toward the flow of people and find the pickpocket again, already angling away, already searching for the next quiet target.\n\nShe steps into his path without blocking it, close enough that he has to notice, far enough that neither of them becomes a scene.\n\n\"You lost something,\" she says, as calmly as if she's correcting a dosage.\n\nHis eyes harden. His hand moves, then stops. He checks himself without thinking, sleeve, belt, pocket.\n\nNothing.\n\nHe looks back at her, and he understands in one clean slice.\n\n\"Don't run,\" Meilin says. \"Running is loud.\"\n\nHe breathes through his nose. He's doing the math. He's deciding whether he can vanish faster than consequence can follow.\n\nMeilin doesn't threaten his body. She threatens his pattern.\n\n\"That stall,\" she says, glancing back without turning her head, \"isn't safe to work anymore. Not because he'll shout. Because I will.\"\n\nThe pickpocket's jaw tightens.\n\n\"Pick someone else,\" she says. \"Or I start asking questions where you hate questions.\"\n\nHe holds her stare for a heartbeat longer, then peels away into the crowd with a face that tries to stay neutral and fails.\n\nJori keeps selling. He keeps smiling. The Bazaar keeps moving.\n\nWhen the rush thins, Jori leans toward Meilin like he's offering a discount.\n\n\"I didn't see,\" he murmurs.\n\n\"You weren't supposed to,\" Meilin says.\n\n\"Why help me.\"\n\nMeilin looks past him, at the crowd, at the stalls, at the quiet economy of shame.\n\n\"Because theft is contagious,\" she says. \"If you bleed coin long enough, you start cutting corners. Then you start doing things you hate because you can't afford better.\"\n\nJori's throat works. He nods once, like he's swallowing a debt.\n\nMeilin taps the counter lightly beside the wax tins, a doctor's knock on a doorframe.\n\n\"Next time,\" she says, quieter, \"tell someone sooner. Pride makes noise. Noise makes targets.\""
}
