{
  "number": "01",
  "title": "First Bolt",
  "skills": ["Hand Crossbow"],
  "cardBrief": "Meilin reads Oona's trembling hands, catalogs the threat's body language like a triage assessment, and fires with control when violence becomes unavoidable.",
  "keyTakeaways": [
    "**Situational awareness**: Meilin clocks a quiet theft unfolding at Oona Marlow's stall before anyone makes noise.",
    "**De-escalation first**: She uses \"inventory talk\" as cover to warn Oona and freeze the thief's timing.",
    "**Controlled response**: When the thief escalates and uses Oona as cover, Meilin draws and fires with control.",
    "**Precision over lethality**: She aims to stop the hand, not to make a corpse.",
    "**Post-threat care**: She holds the lane until the threat breaks and leaves, then checks Oona like a patient.",
    "**Pattern recognition**: She writes down the pattern so it can't happen the same way twice."
  ],
  "content": "The Bazaar had a way of teaching you the difference between *danger* and *inconvenience*.\n\nDanger moved quietly.\n\nMeilin realized that when she noticed **Oona Marlow's** hands first, not her face.\n\nOona was speaking to a customer, smiling politely, selling rope and lantern oil and a bundle of cheap chalk. Her smile never changed.\n\nBut her fingers were trembling in a small, rhythmic way that didn't match the conversation.\n\nMeilin's eyes dropped to what the customer was doing.\n\nNothing dramatic. No knife out. No shout. No \"give me your coin.\"\n\nJust a body positioned wrong.\n\nToo close. Too patient. Too comfortable, like they'd already decided how this ended.\n\nMeilin's mind did what it always did: took a sample.\n\nShe cataloged the details fast, in the silent language of triage.\n\n- Weight on the back foot: ready to step away.\n- Shoulder angled toward the crowd: using noise as cover.\n- One hand visible on the counter.\n- The other… not visible enough.\n\nMeilin shifted half a step so Oona could see her clearly in the corner of their eye.\n\nNot a rescue. Not a scene.\n\nA signal: **I see it too.**\n\nOona's breath changed (tiny, grateful, controlled).\n\nThe customer's hidden hand moved, quick and practiced, toward the cash pouch beneath the counter.\n\nMeilin's fingers touched the small crossbow at her hip.\n\nIt didn't feel like a weapon.\n\nIt felt like admitting she lived in a different world now.\n\nShe didn't draw it.\n\nNot yet.\n\nShe did the first, safer thing: she spoke.\n\n\"That rope's not treated,\" Meilin said to Oona, as if discussing inventory. \"The fibers will fray if it gets wet. You'll lose it in a week.\"\n\nOona blinked, caught, then recovered smoothly. \"Ah. You're right,\" she said, and reached down (toward the pouch) like she was going to check stock.\n\nThe thief's hand froze.\n\nMeilin kept her voice calm, informational. \"And the lantern oil's cut. See the separation? You can smell it if you stop pretending you can't.\"\n\nThe thief's eyes flicked to her face for the first time.\n\nNot anger.\n\nCalculation.\n\nMeilin met the look the way her father met bullies in the clinic: without heat, without flinch, like she was taking a temperature.\n\nThe thief decided to escalate.\n\nThey didn't pull steel.\n\nThey pulled Oona.\n\nA fast yank from behind the counter, using a body as cover and leverage at once.\n\nOona made a small sound, involuntary, as her ribs hit wood.\n\nMeilin's world narrowed into procedure.\n\nDistance. Line of fire. Risk to bystanders.\n\nHer hand crossbow came up in one motion, compact and ugly and honest.\n\nShe didn't aim for center mass.\n\nShe aimed for the hand.\n\nThe shot cracked (small, sharp), swallowed by the Bazaar's noise as if the place had been waiting for it.\n\nThe bolt struck the thief's wrist with a wet, mechanical certainty.\n\nThe thief screamed and let go.\n\nThey stumbled backward, clutching the wound, eyes wide with the shock of consequences in a place that sold them.\n\nMeilin didn't chase.\n\nShe didn't gloat.\n\nShe kept the crossbow trained until the thief was gone into the crowd, limping, noisy, no longer quiet.\n\nOnly then did she lower the weapon.\n\nHer hands were steady.\n\nHer stomach wasn't.\n\nOona stared at her like she'd just changed the weather. \"You could've killed them.\"\n\nMeilin's voice came out even, but it cost her something. \"I didn't.\"\n\nShe stepped behind the stall and crouched. Oona's breathing was fast, shallow, fear plus pain. Meilin put two fingers on their wrist, counted, and nodded once.\n\nAlive. Not bleeding out. No punctured lung.\n\nShe looked at the counter's underside and found the cash pouch's strap half-cut.\n\nNot random.\n\nTools.\n\nPractice.\n\nMeilin's eyes went cold.\n\n\"They'll be back,\" Oona whispered.\n\nMeilin didn't answer immediately.\n\nShe retrieved a strip of cloth from her satchel, wrapped it around the pouch strap, and tied it in a way that would show tampering at a glance. Not unbreakable. Just *visible*.\n\nThen she wrote a single line in her notebook with an ink-stained thumb holding the page flat:\n\n**Pattern: wrist-hook pull → crowd cover → pouch strap cut.**\n\nShe capped the pen and said, quietly, \"Not the same way.\"\n\nOona swallowed. \"What are you?\"\n\nMeilin hesitated. Not because she didn't know.\n\nBecause saying it out loud made it real.\n\n\"Apothecary,\" she said at last.\n\nThen, after a beat, because it was also true:\n\n\"And I don't like people who use bodies as cover.\""
}
