{
  "number": "08",
  "title": "Quiet Feet, Open Eyes",
  "skills": ["Perception", "Stealth"],
  "cardBrief": "Meilin walks a route unarmed to see the truth. She reads shifted stalls and sight lines, lets a pick commit before catching them. Stealth is choosing what people notice.",
  "keyTakeaways": [
    "**Route assessment**: Oona sends Meilin to walk a delivery route and find where it breaks.",
    "**Unarmed for clarity**: Meilin goes unarmed to see the truth, moving like someone forgettable.",
    "**Reading the environment**: She reads the route in stall shifts, kid gangs, and sight lines, not in heroics.",
    "**Controlled interception**: She lets a pick commit, then stops at a bell stall and catches the wrist without a scene.",
    "**Silent communication**: She uses Common Sign Language to warn a stallkeeper while keeping the moment boring.",
    "**Real threat identified**: She finds the real problem (a corner mirror used by watchers) and reports three breaks."
  ],
  "content": "Meilin doesn't become quiet because she wants to be a ghost.\n\nShe becomes quiet because she doesn't want to be a target.\n\nOn Bral, a person can vanish into a crowd if they move like they belong to the crowd. In the Astral Bazaar, the crowd moves like it's alive, and it has teeth.\n\nOona Marlow gives her a simple task.\n\n\"Walk the route,\" Oona says. \"Don't carry anything. Don't buy anything. Just walk it, and tell me where it breaks.\"\n\nMeilin understands. A delivery route is only a route until someone learns it. Then it becomes an ambush schedule.\n\nShe leaves her crossbow at home.\n\nNot because she's trying to be brave. Because she's trying to see the truth without the comfort of a weapon.\n\nShe ties her satchel strap around her wrist anyway, twice, out of habit.\n\nShe moves through the Bazaar with her hood up and her shoulders slightly rounded, like a tired clerk, like someone with no valuables and no dreams. She keeps her hands empty. She keeps her pace steady.\n\nPerception, she discovers, is not about sharp eyes.\n\nIt is about not letting your mind decide too early that you are safe.\n\nThe first break in the route is small.\n\nA stall that sells brass nails has shifted two paces to the left. The vendor smiles too wide, like he's proud of the change.\n\nMeilin logs it mentally.\n\nShifted stalls change sight lines. Shifted sight lines change who can see who.\n\nShe continues.\n\nThe second break is quieter.\n\nThree boys, not more than thirteen, lean near a barrel of rope ends. They aren't doing anything illegal. That's the point. They are just standing, talking, laughing.\n\nMeilin watches their hands.\n\nOne boy keeps his fingers tucked inside his sleeve. Another keeps scratching his neck, an itchy, nervous motion that repeats on a rhythm. The third never looks at her face, only at her belt and the pockets of passersby.\n\nPickpockets, maybe.\n\nOr just kids learning how to be a problem.\n\nMeilin doesn't avoid them. Avoiding them is a signal.\n\nShe passes, steady.\n\nAs she passes, she hears a small sound behind her. Not footsteps. Not speech.\n\nThe whisper of cloth.\n\nShe doesn't turn.\n\nShe shifts her weight and lets her cloak swing a little wider, like a tired person adjusting a garment. She uses the motion to change the angle of her body, to put her left shoulder closer to the wall and her right shoulder closer to the crowd.\n\nHer right pocket is now harder to access.\n\nHer left pocket is now a trap.\n\nShe keeps walking.\n\nShe feels it when it happens, the lightest brush of fingers, the kind that would go unnoticed if you hadn't spent your life watching hands for symptoms.\n\nMeilin lets the fingers enter the left pocket.\n\nShe doesn't grab. She doesn't flinch. She lets the thief commit.\n\nThen she stops, abruptly, in front of a stall where a bell chimes when you turn toward it.\n\nThe bell rings.\n\nThe crowd's attention flickers, briefly, toward sound.\n\nMeilin turns her head slightly, as if considering a purchase. She raises her left hand slowly and closes her fingers around the wrist inside her pocket.\n\nNot hard. Not cruel.\n\nJust enough to say: I know.\n\nBehind her, a boy inhales sharply. The one with his hand tucked inside his sleeve.\n\nMeilin doesn't turn to look at him. She speaks to the stallkeeper, like she's asking about price, and she speaks in Common Sign Language at waist level, where her hands can move without making a show.\n\nTwo signs, simple.\n\nWatch. Hands.\n\nThe stallkeeper's eyes widen, then narrow. He nods once, barely visible, and adjusts the way he stands, shifting to block his own coin tin.\n\nMeilin releases the wrist in her pocket.\n\nThe fingers vanish like smoke.\n\nShe keeps walking.\n\nStealth, she realizes, is not only about moving quietly.\n\nIt is about choosing what people notice, and what they don't, and doing it without turning the moment into a story that can be repeated against you later.\n\nAt the final bend of the route, she finds the third break.\n\nA mirror.\n\nNot the decorative kind. A polished brass panel set at a corner, angled to show the alley behind you.\n\nMeilin stops and looks at her own reflection, hooded and small. She looks past it, into what the mirror reveals.\n\nTwo figures stand in the alley, pretending to talk.\n\nOne of them looks at the mirror. Not at her.\n\nThey are using it too.\n\nMeilin walks on, steady, and her skin goes cold with understanding.\n\nThis route has been watched long enough that the watchers have invested in better tools.\n\nWhen she returns to Oona, she doesn't give a dramatic warning. She gives a report.\n\n\"Three breaks,\" she says. \"Stall shift at the brass nails, kids at the rope barrel, and a corner mirror that someone else is reading.\"\n\nOona's eyes sharpen. \"You sure about the mirror.\"\n\nMeilin nods. \"They looked at it to look at me.\"\n\nOona exhales once, slow. \"That's good work.\"\n\nMeilin doesn't smile.\n\n\"It's not good,\" she says. \"It's early.\""
}
