{
  "number": "06",
  "title": "A Polite Lie in Undercommon",
  "skills": ["Deception", "Undercommon"],
  "cardBrief": "Meilin uses a plausible, controlled lie as leverage: not big, not dramatic, just enough to steer a decision. Speaking Undercommon signals she isn't a soft mark.",
  "keyTakeaways": [
    "**Knowing the room**: Meilin enters a nameless shop that sells \"hinges\" and other quiet problems.",
    "**Language as signal**: She switches into Undercommon to signal she isn't a soft mark.",
    "**Reading the price**: She asks for a bolt case that won't rattle and watches what the clerk prices as danger.",
    "**Implication over threat**: She leverages reputation by implication, not threats, and keeps the lie plausible.",
    "**Mutual assessment**: The clerk tests her, then chooses to deal, lowering the price to fair-for-this-place.",
    "**Controlled exit**: Meilin leaves with the case and a controlled warning delivered without drama."
  ],
  "content": "There is a kind of shop in the Astral Bazaar that never puts its name on a sign.\n\nIt sells \"hinges.\" It sells \"chalk.\" It sells \"repair kits\" in sealed tins that weigh too much for what they claim to be.\n\nMeilin only comes when she has a reason, and she comes with her cloak hood up and her notebook hidden flat against her ribs.\n\nInside, the air smells like old metal and newer fear.\n\nThe clerk behind the counter is not Bralian. Not by accent. Not by posture. He watches her the way a lock watches a pick.\n\n\"Common,\" he says, without asking. \"State your business.\"\n\nMeilin answers in Undercommon.\n\nNot fluent, not pretty, but correct enough to make his eyebrows lift and his attention sharpen.\n\n\"I need a bolt case that won't rattle,\" she says. \"And I need it to look like it should.\"\n\nThe clerk pauses, then replies in the same language, more smoothly than she can.\n\n\"That costs extra.\"\n\nMeilin nods once, like she expected that outcome. She keeps her hands visible. Palms empty. No threat. No plea.\n\n\"I can pay,\" she says. \"But I won't pay twice.\"\n\nThe clerk smiles, thin and professional. \"You think I cheat my customers.\"\n\nMeilin gives him a small, calm look. \"I think you charge for danger, and you hide danger inside the charge. It's efficient.\"\n\nHis smile widens. He likes that. She didn't call him a thief. She called him a tradesman.\n\nHe reaches under the counter and produces two bolt cases. Same leather. Same stitching. One is slightly stiffer, like it has an inner lining.\n\n\"This one is quiet,\" he says, tapping the stiffer case. \"This one is normal.\"\n\nMeilin doesn't touch either one yet.\n\nShe leans in a fraction and lowers her voice, still in Undercommon.\n\n\"If you sell me the wrong one,\" she says, \"I'll find out later, and I'll tell Oona Marlow that your quiet work isn't quiet.\"\n\nThe clerk's eyes flick, fast, to a corner of the room where a curtain hides a back door.\n\nNot guilt.\n\nCoordination.\n\nMeilin continues, same tone, a medic explaining consequences.\n\n\"If you sell me the right one,\" she says, \"I'll tell her your prices are honest for what you are.\"\n\nThe clerk's expression doesn't change much, but his shoulders relax a hair. He believes she can reach Oona. He believes Oona matters.\n\nMeilin didn't say she knows Oona well.\n\nShe didn't say Oona would care.\n\nShe simply offered a future that the clerk could measure.\n\nThat is the kind of lie that survives the Bazaar. Not big. Not dramatic. Just plausible enough to steer a decision.\n\nThe clerk slides the stiffer case forward.\n\n\"Quiet,\" he says.\n\nMeilin finally picks it up.\n\nShe squeezes it lightly. Listens. Feels for hidden seams and cheap lining. The case is good. The stitching is even. The leather is treated.\n\n\"How much,\" she asks.\n\nHe names a number that is too high by a small, insulting margin.\n\nMeilin doesn't flinch. She also doesn't accept it.\n\n\"No,\" she says, still in Undercommon. \"That's the price if I came in shaking. I didn't.\"\n\nThe clerk's lips part, then close. He studies her.\n\n\"What are you,\" he asks, and his voice is careful now.\n\nMeilin considers telling the truth.\n\nApothecary. Log keeper. Someone who cares too much.\n\nInstead she gives him a different truth, one that fits the room.\n\n\"I'm a crew problem,\" she says. \"The kind that doesn't go away if you ignore it.\"\n\nThe clerk laughs once, quiet and genuine. He lowers the price to something still painful, but fair for this place.\n\nMeilin pays.\n\nAs she turns to leave, the clerk adds, almost casually, \"You speak well for a surface girl.\"\n\nMeilin pauses with her hand on the curtain.\n\nShe looks back and answers in Common, flat as a ledger entry.\n\n\"I listen better than I speak.\"\n\nThen she goes out into the Bazaar's noise, with a bolt case that won't rattle, and a name that she didn't give, and a small lie she can live with because it kept her crew safer."
}
