{
  "number": "02",
  "title": "Vex Lesson",
  "skills": ["Weapon Mastery (Vex)", "Sneak Attack"],
  "cardBrief": "Theo drills Meilin until the crossbow becomes procedure, not performance. She learns to strike when attention is split: exploit the flinch, hit when the target is already compromised.",
  "keyTakeaways": [
    "**Method over heroics**: Theo sets a target and refuses to call it training; he calls it repetition.",
    "**Muscle memory**: Meilin drills the hand crossbow until the motion becomes procedure.",
    "**Exploit the flinch**: Theo teaches her the real point: hit to steal a moment, then exploit the blink.",
    "**Tactical patience**: She learns to wait for split attention and wrong footing, not for \"fair.\"",
    "**Live application**: Days later, a crowd incident gives her a live test of that lesson.",
    "**Precision in chaos**: She fires when the real actor commits, then cuts a runner free before the scene turns lethal."
  ],
  "content": "Theo Lockwell didn't call it training.\n\nThey called it **repetition**.\n\nMeilin stood in a narrow alley behind their shop where the Bazaar's noise turned into a constant hiss. Someone had painted a target circle on a board that used to be a crate lid. The paint was old enough to have given up on perfection.\n\nTheo set a compact crossbow on the bench like it was a tool, not a statement.\n\n\"It's not a duelist's weapon,\" they said. \"It's for people who don't get second chances.\"\n\nMeilin didn't argue. She checked the string. Checked the notch. Checked the bolt seating. Her fingers moved in the same pattern she used when laying out bandage, needle, tincture: everything in reach, everything where it belonged.\n\n\"You don't shoot to be brave,\" Theo continued. \"You shoot to make the next moment easier.\"\n\nMeilin raised the weapon.\n\nThe first bolt went wide.\n\nTheo didn't laugh. He just nodded like he'd expected that outcome.\n\n\"Again,\" they said.\n\nMeilin breathed out, slow, and shot again.\n\nThis time the bolt struck the board with a blunt, satisfying thunk. Not center. Not perfect. But **true**.\n\nTheo said, \"Good. Now do it the way it matters.\"\n\nThey stepped into Meilin's peripheral vision (not blocking the shot, just *present*).\n\nMeilin's hands tightened.\n\n\"You see?\" Theo said. \"The Bazaar never gives you a clean lane. People move. They shout. Someone's always in the way.\"\n\nMeilin didn't lower the crossbow. She did what she did when a patient started panicking: narrowed her attention to the useful variables.\n\nAngle. Risk. Breath.\n\nThen she fired.\n\nThe bolt struck the board again.\n\nTheo's mouth twitched. \"Now you're learning.\"\n\nMeilin frowned. \"That wasn't different.\"\n\nTheo tapped the board with a knuckle. \"It was. You didn't chase precision. You chased **control**.\"\n\nThey walked behind her and spoke close to her ear, not threatening, just teaching.\n\n\"When you land a hit, you steal a moment from them,\" they said. \"Pain makes people blink. Anger makes them look at the wrong thing. That blink is your opening.\"\n\nMeilin's eyes flicked to the bolt sunk in the wood. A new kind of ledger entry.\n\nCause. Effect.\n\nTheo slid another bolt into her reach. \"Put the next one where it belongs.\"\n\nMeilin raised the crossbow again.\n\nShe didn't aim with romance.\n\nShe aimed with math.\n\nThe bolt struck the board a handspan from the first. Close enough to prove intent. Close enough to say: **I can repeat this.**\n\nTheo nodded once. \"That's the point. Not the first hit. The second.\"\n\nMeilin's pulse steadied.\n\nShe could feel the shape of it now: hit, then exploit the flinch, the way a system showed you its weakness the moment you applied pressure.\n\nShe didn't call it mastery.\n\nShe called it **practice until it becomes procedure**.\n\n---\n\nThe Bazaar tested her lesson within days.\n\nIt wasn't a dramatic fight. It was the kind of problem that grew from crowds: a vendor screaming, a customer claiming theft, a guard stepping in with the bored cruelty of someone who'd rather punish than understand.\n\nThe accused was a young runner (thin, scared, and too proud to beg). Their wrists were bound with cord tight enough to leave pale lines.\n\nMeilin didn't care about the shouting.\n\nShe cared about the hands.\n\nShe moved like she belonged there, because looking lost was the fastest way to become prey. The crowd tightened. The guard barked something about \"order.\"\n\nThen someone in the back shifted.\n\nNot toward the guard.\n\nToward the bound runner.\n\nMeilin saw it the way she saw contamination: the wrong movement in the wrong place. A second actor. A follow-up. The real theft about to happen while everyone watched the loud part.\n\nThe runner flinched as the hidden figure closed in (half protection, half opportunism). Meilin couldn't tell.\n\nIt didn't matter yet.\n\nMeilin's hand crossbow came up under her cloak line, compact and unheroic.\n\nShe waited.\n\nNot because she was afraid.\n\nBecause she was disciplined.\n\nThe guard was still yelling. The crowd was still staring. The hidden figure's attention was split: on the runner's pocket, on the guard's distraction, on their own exit.\n\nMeilin fired.\n\nThe bolt hit meat, not bone, high in the shoulder, a place that made a person drop what they were doing and turn toward the pain.\n\nThe figure staggered, surprised into honesty.\n\nIn that same heartbeat, the guard's attention snapped away from the runner.\n\nThe crowd broke its shape.\n\nMeilin didn't take a victory lap.\n\nShe stepped in close, fast, and cut the runner's cord with a blade that looked like an apothecary's tool because it *was* an apothecary's tool.\n\n\"Move,\" she said quietly, not kind, not cruel, clinical.\n\nThe runner bolted into the crowd like they'd been waiting for permission to live.\n\nBehind them, the wounded figure tried to stand their ground, eyes wild with rage.\n\nMeilin didn't give them a speech.\n\nShe simply re-aimed while their attention was still broken, while their stance was still wrong, while their mind was still catching up to pain.\n\nAnd she understood, with the cold clarity of a diagnosis:\n\nThe hit wasn't the trick.\n\nThe trick was choosing the moment when the target couldn't afford to fully notice her.\n\nThat was how she survived the Bazaar.\n\nNot by fighting fair.\n\nBy fighting **when the system was already distracted**."
}
