{
  "number": "03",
  "title": "Cant Notes",
  "skills": ["Thieves' Cant"],
  "cardBrief": "Meilin learns the Bazaar's under-language by treating it like symptoms: repeated phrases, chalk marks, pauses that don't match the words.",
  "keyTakeaways": [
    "**Listening for subtext**: Meilin starts hearing \"the other language\" under ordinary Bazaar chatter.",
    "**Pattern logging**: She logs repeated phrases and chalk marks like symptoms, not like trophies.",
    "**Recognition through context**: The meaning clicks when Oona uses small talk as warning and confirmation.",
    "**Procedural response**: Meilin answers the signal with procedure; she bars a door and reduces exits.",
    "**Documentation for recall**: She writes the translation down so it stays usable under stress.",
    "**Ethical guardrails**: She keeps one ethics note attached: don't use the language to spend innocents."
  ],
  "content": "The Bazaar was loud in the way oceans were loud.\n\nNot a single noise. An ecosystem of them.\n\nMeilin learned quickly that if you listened only to the words, you missed the important part.\n\nThe important part was everything **around** the words.\n\nThe pause before a price. The way a vendor said \"fresh\" like a warning. The way a customer said \"just looking\" and still angled their body to block a line of sight.\n\nAnd then there was the other language.\n\nThe one people used when they wanted to be understood by exactly the wrong number of witnesses.\n\nMeilin first heard it outside a stall that sold \"map cases\" and \"scroll tubes\" and other innocuous containers that always seemed to be purchased by people with clean hands and dirty work.\n\nTwo men stood close enough to look like friends and far enough to look like strangers.\n\n\"Nice weather,\" one of them said, smiling up at nothing.\n\nThe other nodded. \"Wind's turning.\"\n\nMeilin kept walking.\n\nHer notebook stayed in her satchel.\n\nBut her mind did what it always did: translated symptoms into causes.\n\nIf they were really talking about weather, no one would bother to stand like that. No one would check the alley behind them before they spoke. No one would smile with their mouth and not their eyes.\n\nThey weren't talking about wind.\n\nThey were talking about **risk**.\n\n---\n\nMeilin didn't learn Thieves' Cant from a mentor who gave her a speech.\n\nShe learned it the way she learned everything that mattered:\n\nBy watching it happen three times and refusing to pretend that was coincidence.\n\nThe second time she heard it, it came with a different surface story.\n\n\"Good stitching,\" a woman said to a cloaked passerby, as if complimenting a hem.\n\nThe passerby didn't stop. \"Needs reinforcement,\" they replied, calm as cloth.\n\nThe woman's hand drifted to the edge of a crate, fingers brushing a chalk mark shaped like a crescent.\n\nMeilin noticed because she always noticed chalk.\n\nChalk was procedure. Chalk was someone trying to make the invisible visible.\n\nShe waited until the woman left, then stepped in close and looked at the mark.\n\nA crescent.\n\nBeneath it, a tiny dot.\n\nNot decoration.\n\nA note.\n\nMeilin didn't know what it meant yet.\n\nSo she did the only honest thing:\n\nShe wrote it down.\n\nNot in big letters. Not in a way that would make her feel clever.\n\nJust a small entry, tabbed and indexed like a patient chart:\n\nCrescent + dot (crate corner). Heard: \"Good stitching.\" Reply: \"Needs reinforcement.\"\n\n---\n\nThe third time, the meaning arrived without permission.\n\nIt happened at the back of a gear stall where Meilin sometimes did quiet work. A runner came in with a basket and a face that looked too calm for the pace of their breathing.\n\nOona Marlow said, lightly, \"You're early.\"\n\nThe runner answered, \"Couldn't sleep.\"\n\nMeilin caught it: Oona's fingers tightened on the counter in the space between words. The runner's eyes flicked to the door, then to the alley beyond it.\n\nNot insomnia.\n\nPressure.\n\nOona nodded once and said, \"Have you eaten?\"\n\nThe runner's voice stayed even. \"Not since yesterday.\"\n\nMeilin's stomach went cold.\n\nShe'd heard dockhands say \"I haven't eaten\" to mean hunger.\n\nThis didn't sound like hunger.\n\nThis sounded like **I haven't been safe**.\n\nOona slid a small paper packet across the counter (something that looked like a cheap snack). Her hand lingered on it half a beat too long.\n\nThe runner took it without looking down.\n\nThen Oona said, pleasantly, to no one in particular: \"Weather's turning.\"\n\nThe runner replied, equally pleasant: \"Wind's turning.\"\n\nMeilin felt the click in her head.\n\nSame phrase as the first time.\n\nOona glanced toward the alley and, without changing expression, shifted a crate a finger's width to expose a chalk crescent and dot.\n\nThen she looked at Meilin, just once.\n\nNot asking.\n\nMeasuring.\n\nMeilin didn't speak.\n\nShe simply moved to the back door and barred it with a length of wood.\n\nNo drama. No questions. Just procedure.\n\nIf this was what she thought it was, the best way to \"answer\" was to reduce exits.\n\nFootsteps came a minute later: two sets, then three. Voices outside, casual and too close. Someone knocked in the polite way people knocked when they wanted you to open the door so they could claim you let them in.\n\nMeilin stayed still and listened.\n\nOona murmured, barely audible, \"Hold steady.\"\n\nMeilin kept her hands off her crossbow.\n\nNot because she was unarmed.\n\nBecause she understood, suddenly, that this language wasn't about bravery.\n\nIt was about **coordination**.\n\nAbout telling the right people the right thing while sounding like you were talking about soup.\n\nThe footsteps drifted away.\n\nThe pressure moved on to a softer target.\n\nOona exhaled.\n\nMeilin wrote another line in her notebook:\n\n**Weather's turning / Wind's turning = warning + confirmation.**\n\nThen, after a beat, because she was Meilin and ethics were a kind of spine:\n\n**Do not use on innocents. Do not sell names.**\n\n---\n\nLater, when someone tried to test her, and a stranger asked too casually where she slept and who she worked for, Meilin answered in the Bazaar's dialect without giving them anything real.\n\n\"Busy season,\" she said mildly.\n\nAnd when the stranger pressed, smiling, Meilin added, \"Wind's turning.\"\n\nThe stranger's smile tightened.\n\nNot because they understood the *words*.\n\nBecause they understood what the words meant:\n\n**I am not alone. I am not lost. Choose another mark.**\n\nMeilin didn't enjoy that.\n\nShe didn't collect it like a trophy.\n\nShe treated it like every other tool in her kit:\n\nUseful. Dangerous. Logged."
}
