{
  "number": "07",
  "title": "Persuasion is Triage",
  "skills": ["Persuasion"],
  "cardBrief": "Meilin talks a sailor down by naming consequences and next steps, not by moralizing. She treats de-escalation like triage: identify the real hazard, give simple instructions.",
  "keyTakeaways": [
    "**Escalating scene**: Two sailors pin a runner over a shattered crate, and the scene is about to get worse.",
    "**Hazard assessment first**: Meilin checks the hazard first, then speaks like a medic, not a judge.",
    "**Naming the chain reaction**: She points out the real problem (glass and bleeding) and names the chain reaction.",
    "**Harm reduction**: She gives simple next steps that reduce harm without granting anyone a victory story.",
    "**Procedure over pride**: The \"thinking\" sailor chooses procedure over pride, and the situation unlocks.",
    "**Redirect to accountability**: Meilin cleans the small wound and pushes accountability toward a foreman, not violence."
  ],
  "content": "The first time Meilin talks a sailor out of making things worse, she doesn't feel proud.\n\nShe feels tired.\n\nIt happens in the narrow spine of a dock corridor where cargo nets hang like cobwebs and the air tastes faintly of tar and citrus. Two sailors have a young runner pinned against a crate. Not for theft. For a spilled crate of glass vials that shattered and made a mess that looked expensive.\n\nThe runner's hands are up. Their eyes are bright with panic. Their breathing is too fast and too shallow, like someone drowning in air.\n\nOne sailor is doing the shouting. The other is doing the thinking.\n\nMeilin approaches and stops at a distance that keeps her out of reach. She doesn't draw a weapon. She doesn't raise her voice.\n\nShe looks at the broken glass first.\n\nNot because she cares about the goods.\n\nBecause she needs to know what kind of danger it is.\n\n\"Back up,\" the shouting sailor snaps. \"This doesn't involve you.\"\n\nMeilin keeps her gaze on the shards. \"It does if it's alchemical,\" she says. \"What was in the vials.\"\n\nThe shouting sailor hesitates. That tiny pause tells her he doesn't know. He's mad about the mess, not the hazard.\n\nThe thinking sailor answers instead. \"Perfume oils,\" he says. \"And some kind of tonic. Smelled like mint.\"\n\nMint.\n\nMeilin's mind runs through the list of things that smell like mint and still hurt you.\n\nShe steps half a pace closer, careful where she places her feet.\n\n\"You're going to cut yourself,\" she says to the sailor with the runner pinned. Not a threat. A prediction.\n\n\"We're fine,\" the shouting sailor says, louder.\n\nMeilin nods once. \"Sure. But I'm not here to argue about fine. I'm here to stop bleeding.\"\n\nThe thinking sailor's eyes flick to the glass, then to his own boot. A shard has bitten into the edge of the sole where the leather is thin. A small smear of red has appeared near the ankle seam. Not much. Enough.\n\nMeilin points at his boot with two fingers, precise. \"You're already bleeding.\"\n\nThe sailor looks down. His posture shifts. It's the first real change in the scene.\n\nMeilin uses it.\n\n\"If your boot's bleeding,\" she says, calm and factual, \"then your deck is bleeding. Someone's going to slip. Someone's going to fall into the shards. Then your problem stops being a runner and becomes a crew member.\"\n\nThe shouting sailor's jaw tightens. \"So what, we let them off.\"\n\nMeilin doesn't answer that question directly. She answers the one underneath it.\n\n\"You want someone to pay,\" she says. \"I get it. You also want to get home with your fingers intact.\"\n\nShe gestures to the runner, whose knees are starting to shake.\n\n\"That one is about to bolt or faint,\" Meilin continues. \"If they bolt, you chase them, you step wrong, and you get cut. If they faint, you drop them, and their face meets glass.\"\n\nThe thinking sailor swallows. He can see it now. The chain reaction.\n\nMeilin shifts her tone from diagnosis to instruction.\n\n\"Let them sit,\" she says. \"Just sit. Keep your hand on their shoulder if you need to keep control. Do not pin them against the crate. The crate corner is sharp.\"\n\nThe shouting sailor scoffs, but the thinking sailor loosens his grip.\n\nThe runner sags like their bones were waiting for permission.\n\nMeilin crouches, still out of reach, and slides her satchel to her front without taking her eyes off the sailors.\n\n\"I'm going to clean your boot,\" she says to the thinking one. \"Then I'm going to clean the deck enough that no one dies for perfume.\"\n\nThe shouting sailor spits to the side. \"And who are you supposed to be.\"\n\nMeilin looks up.\n\nHer voice stays soft, and it stays even, because that's how you talk to a panicking patient and a panicking crowd.\n\n\"Someone who writes down what really happened,\" she says. \"If you want a story, keep yelling. If you want your captain to hear you handled it like professionals, let me do my work.\"\n\nThe shouting sailor's eyes narrow.\n\nMeilin doesn't blink first.\n\nBehind him, the thinking sailor shifts his weight and says, quieter, \"Let her.\"\n\nIt's not surrender. It's a decision.\n\nMeilin cleans the boot. She scrapes the worst glass away with a folded scrap of stiff paper. She uses a little salve, not enough to waste, just enough to keep the skin from cracking and reopening on the next step.\n\nThen she looks at the runner.\n\n\"Name,\" she says.\n\nThe runner gives it, voice thin.\n\nMeilin nods and says, to the sailors, \"If you want repayment, take it from their wages through their foreman. If you want punishment, take it to a dockmaster. If you want to hurt someone because you're embarrassed, do it without pretending it's justice.\"\n\nThe shouting sailor opens his mouth, then closes it. He doesn't like being described accurately.\n\nMeilin stands.\n\n\"You're done here,\" she says, to no one in particular, and the phrase carries the weight of procedure.\n\nThe sailors grumble, but they step back. The corridor breathes again.\n\nLater, when the runner tries to thank her, Meilin only shakes her head.\n\n\"Don't thank me,\" she says. \"Remember the pattern. Loud anger makes accidents. Quiet choices keep people alive.\""
}
