{
  "number": "07",
  "title": "Shipboard Scare",
  "sectionTitle": "The Drift-Sparrow",
  "icon": "ship",
  "pullQuote": "The easiest way to control people wasn't a blade. It was what you fed them.",
  "keyTakeaways": [
    "**What happens**: Meilin takes a short contract on the *Drift-Sparrow* and finds a \"nothing\" sickness with teeth.",
    "**Key relationships**: Captain **Rellan Thorne** hires her; Quartermaster **Tasmin \"Cleanhands\" Vale** becomes her ally/foil on inventory control.",
    "**What she learns**: Ship stores are life support: seals, seams, and handling are evidence; dinner is a diagnostic event.",
    "**Ongoing hook**: The contamination points to supply-side dosing (not superstition), sharpening her focus on distributors and lot marks."
  ],
  "content": "Meilin didn't take her first ship contract because she wanted the stars.\n\nShe took it because the docks had started feeling like a room with too many doors, and too many people learning which ones she used.\n\nThe offer came through Meredin the way most of Meredin's offers did: not dressed up as rescue, not softened with sentiment.\n\n\"A ship needs a hand,\" Nori said, standing in Meilin's doorway like they belonged there. \"Short contract. Clean pay. Quiet captain.\"\n\nMeilin didn't look up from the counter where she was rewrapping vials in cloth to keep them from clinking. \"Quiet captain is a contradiction.\"\n\nNori's mouth twitched. \"This one's more quiet than most.\"\n\nMeilin's father, Kaito Starwell, was in the back, washing instruments. She could hear the steady rinse, the measured clink of metal.\n\n\"A ship,\" Meilin said. \"Why?\"\n\nNori shrugged. \"Crew's been getting sick. They don't want the clinics. They don't want rumors. They want a person who solves problems and doesn't write sermons about it.\"\n\nMeilin felt her father's gaze without seeing it. The old warning, worn smooth: *Maps lead places.*\n\nShe set the last vial into her satchel. \"Ship name?\"\n\n\"The *Drift-Sparrow*,\" Nori said. \"Leaves on the next good window.\"\n\nMeilin paused. \"And what does Meredin want?\"\n\nNori's expression was practical. \"Meredin wants the crew not to die.\"\n\nMeilin swallowed the answer she wanted to give (*and me?*) because she already knew it.\n\nThe docks didn't just make you useful. They made you accountable.\n\nSo she went.\n\n---\n\nThe *Drift-Sparrow* didn't look like the heroic silhouettes painted on tavern signs. It looked like work: patched planks, scuffed rails, an old spelljammer helm tucked under canvas as if modesty could make it less expensive. A ship built to survive more than to shine.\n\nThe first thing Meilin noticed wasn't the rigging.\n\nIt was the smell.\n\nShips had a particular scent: tar, old wood, sweat, salt carried from a thousand ports. But under it was something wrong: a faint, sweet-stale note that didn't belong to fresh supplies. Like grain that had breathed too long in a damp barrel. Like tea leaves that had been \"improved.\"\n\nShe stepped onto the gangplank and felt the deck sway under her, the way a body sways when it's trying to keep secrets.\n\nA sailor with a wide grin greeted her. \"Apothecary! You're the one who tastes poisons, right?\"\n\nMeilin didn't slow. \"I'm the one who makes sure you wake up tomorrow.\"\n\nHe laughed like that was the same thing.\n\nCaptain Rellan Thorne met her near the helm, older, lean, eyes tired in the honest way. He gave his name once and didn't linger on it, as if names were things that got caught in teeth.\n\n\"Starwell,\" Thorne said. \"You'll have a bunk and a share. We're not farbound, just a short run out and back, escort and resupply. Keep my people on their feet.\"\n\nMeilin glanced over the crew. She saw it immediately: pallor that wasn't just lack of sunlight, hands that shook too much to be nerves, eyes ringed with the kind of fatigue sleep didn't fix.\n\n\"How long?\" she asked.\n\nThe captain's jaw tightened. \"Weeks.\"\n\n\"What changed?\" Meilin asked.\n\nHe hesitated. \"Nothing.\"\n\nMeilin looked at him until \"nothing\" wilted.\n\nFinally he said, \"New supplier. Cheaper. Same stamps as always.\"\n\nMeilin's fingers tightened on her satchel strap. \"Show me your stores.\"\n\nThe captain exhaled slowly, as if he'd been hoping she'd start with bandages instead. \"Quartermaster handles inventory,\" he said. \"You'll talk to Vale.\"\n\n---\n\nQuartermaster Tasmin \"Cleanhands\" Vale met her outside the hold with a ring of keys and an expression like a locked door.\n\nVale was neat in a way the ship didn't deserve. Sleeves rolled with precision. Hands clean despite the work. Hair tied back. Everything about them said *order is how we keep from dying*.\n\nThey looked Meilin up and down, their gaze flicking to the satchel, the cloth-wrapped vials, the ink-stained fingers.\n\n\"You're the apothecary,\" Vale said, tone neutral but edged. \"Captain says you want access.\"\n\n\"I want your stores,\" Meilin replied.\n\nVale's eyes narrowed a fraction. \"That's not how this works. If you need something, you request it. I log it. You receive it.\"\n\nMeilin gave a small, polite smile that meant nothing. \"And if what you logged is what's making your crew sick?\"\n\nVale didn't blink. \"We keep clean inventory.\"\n\nMeilin lifted her hands slightly, palms out. \"I'm not accusing you of filth. I'm saying something is wrong.\"\n\nVale's jaw set. \"And you think the solution is to rummage through my hold like a dock rat?\"\n\nMeilin's smile thinned. \"I think the solution is to stop your crew from dying of 'nothing.'\"\n\nThat got Vale's attention (not their emotions, but their brain). They hesitated, caught between principle and outcome.\n\nFinally Vale turned the key. \"You touch anything,\" they said, \"and I'll know.\"\n\nMeilin stepped into the hold and breathed in.\n\nGrain. Salt. Dried meat. Tea. Oil. The comforting skeleton of survival.\n\nAnd underneath it (again), that faint wrong sweetness.\n\nMeilin moved like she was in a clinic: slow, deliberate, respectful of the space. She didn't tear into crates. She didn't spill sacks. She ran her fingers along seams and listened to the subtle language of storage: dampness, residue, wax seals that had been re-melted.\n\nVale hovered a step behind her like a shadow with opinions.\n\n\"What are you doing?\" Vale asked.\n\n\"Reading,\" Meilin said.\n\n\"You can read with your fingers?\"\n\nMeilin didn't answer. She picked up a sack of flour and tilted it, listening to the way it settled. Too clumpy. She sniffed near the seam, and caught the faint smell of something that wasn't flour.\n\nShe set it down and pulled a small strip of wax paper from her satchel. Carefully, she scraped a trace from the seam and folded it away.\n\nVale's voice sharpened. \"That's inventory.\"\n\nMeilin looked back. \"That's evidence.\"\n\nVale stared at her. \"We don't do 'evidence' on a ship.\"\n\nMeilin's eyes were cool. \"Yes,\" she said. \"You do. You just call it 'bad luck' until it kills someone.\"\n\nVale's mouth tightened. \"What do you want?\"\n\nMeilin gestured around them. \"I want to know why half your crew looks like they've been bled slowly. And I want it in time to fix it.\"\n\nVale's shoulders rose and fell once (an effort of restraint). \"Fine. You have one hour. Then you stop.\"\n\nMeilin nodded. \"One hour is enough to find the lie.\"\n\n---\n\nThe sickness announced itself properly that night at dinner.\n\nThe galley was warm and cramped, lit by lanterns that made everyone's faces look more tired than they were. The cook (a broad-shouldered woman with scars on her knuckles and pride in her eyes) served stew with the grim triumph of someone keeping people fed in a place where food was always one mistake from disaster.\n\nA toast was raised. The captain said something brief. Someone laughed.\n\nMeilin watched the bowl in front of her like it might speak.\n\nShe dipped a spoon, lifted it, and paused.\n\nThe cook's eyes narrowed instantly. \"Don't start,\" she warned.\n\nMeilin didn't look away. She sniffed once. Then again.\n\nThe cook's pride flared. \"It's stew, not a ritual. Eat.\"\n\nMeilin's voice was mild. \"Who handled the salt?\"\n\nThe table went quiet in the way it does when someone commits a social crime with a straight face.\n\nThe cook's cheeks reddened. \"What?\"\n\nMeilin looked around. \"Who handled the salt.\"\n\nA sailor gave a nervous laugh. \"Gods, she's serious.\"\n\nVale's gaze cut toward Meilin like a knife. *Not now.*\n\nMeilin didn't flinch. \"I'm not insulting you,\" she said to the cook. \"I'm trying to keep you from being blamed when this goes wrong.\"\n\nThe cook slammed her ladle down. \"It's not going wrong.\"\n\nRight on cue, someone at the far end of the table coughed (wet, sharp) and then gagged as if their throat had decided to turn on them. Another sailor pressed a hand to their temple, eyes unfocusing, and whispered, \"It's happening again.\"\n\nThe cook froze, pride collapsing into fear.\n\nMeilin stood so fast her stool scraped. \"Water,\" she said, already moving. \"Clean. Now.\"\n\nThe captain barked orders. The galley erupted into controlled chaos.\n\nMeilin knelt by the coughing sailor and took their wrist, feeling the pulse. Fast. Too fast. She lifted their chin, checked their mouth, eyes, skin.\n\n\"Any chest tightness?\" she asked.\n\nThe sailor shook their head, coughing harder.\n\nMeilin's mind ran through routes. Not curse. Not wound. Not infection in this timing.\n\nExposure.\n\n\"Did it start after you ate?\" she asked.\n\nThe sailor nodded.\n\nMeilin looked up at the cook. \"What changed tonight?\"\n\nThe cook's eyes were wide. \"Nothing. Same as always.\"\n\nMeilin's gaze flicked to the spice shelf, to a small tin near the back. It wasn't the tin itself.\n\nIt was the way the lid sat.\n\nToo tight, as if someone had reseated it with care.\n\nMeilin crossed the galley in two steps, grabbed the tin, and cracked it open.\n\nA sharp, bitter scent hit her: spice and something else riding underneath. Something fine, dusty, deliberate.\n\nVale appeared beside her, voice low and furious. \"What are you doing.\"\n\nMeilin held the tin up. \"This.\"\n\nVale stared. \"That's pepper.\"\n\nMeilin tilted the tin so the lanternlight caught the powder. Most of it was pepper. But threaded through it (barely visible) was a paler dust that clung differently, like it belonged to a different grind.\n\n\"Pepper doesn't separate like that,\" Meilin said.\n\nVale's face tightened. \"You can't know that.\"\n\nMeilin's eyes were bright in a way that scared people who knew her. \"I can,\" she said softly. \"Because I nearly died of 'tea' once.\"\n\nThe cook whispered, \"I didn't… I swear…\"\n\n\"I know,\" Meilin said immediately, the same words she'd given Hask. \"That's why I'm not accusing you. I'm asking who had access.\"\n\nThe cook swallowed. \"Anyone. Everyone.\"\n\nMeilin's mind clicked into place. Communal. Subtle. Deniable.\n\nShe didn't announce it.\n\nShe simply set the tin down and did something that made three sailors flinch.\n\nShe dipped one finger into the powder and touched it to her tongue.\n\nVale grabbed her wrist. \"Don't…\"\n\nMeilin swallowed.\n\nThe taste hit: pepper bite, then a lingering bitter-metal note that blossomed in the back of her throat like a warning.\n\nMeilin exhaled once, calm as a chart. \"Mindersand,\" she said.\n\nVale stared. \"That's…\"\n\n\"A 'drying powder.' A 'preservative.' Whatever name makes it sound harmless,\" Meilin cut in. \"Not lethal for most. Not fast. Designed to make you shaky, fogged, compliant. Enough to ruin judgment. Enough to make a crew 'accident-prone.'\"\n\nThe captain stared at her. \"Can you treat it?\"\n\n\"Yes,\" Meilin said. \"If it stops now. If it doesn't, it will stack. Dose on dose.\"\n\nVale's grip loosened. Their voice came out tight. \"How long have we been eating this.\"\n\nMeilin looked at the tin. \"Long enough that someone thinks you won't notice.\"\n\nVale's eyes went distant (the ledger-mind running). \"Supply,\" they whispered. \"This isn't onboard.\"\n\nMeilin met their gaze. \"No,\" she agreed. \"This is before you ever left port.\"\n\nFor a heartbeat, the galley was silent except for the sick sailor breathing hard.\n\nThen Vale straightened, anger sharpening into purpose. \"Show me the sacks,\" they said. \"All of them. Right now.\"\n\nMeilin's mouth twitched, an almost-smile, not of victory but of recognition.\n\nThis was how obsession was born: not from curiosity alone, but from necessity.\n\nA ship didn't have the luxury of pretending food was comfort.\n\nFood was control. Water was control. The galley was a battlefield that refreshed itself three times a day.\n\nThat night, while the crew slept in uneasy pockets of exhaustion, Meilin and Vale stood in the hold under lanternlight and opened sack after sack like surgeons.\n\nVale's hands stayed clean.\n\nMeilin's hands became ink-stained again as she marked lot symbols, compared stamps, traced which crates came from which vendor, which vendor came from which warehouse.\n\nAt some point, Vale spoke without looking up.\n\n\"You're going to start taking things,\" they said flatly. \"Samples. Scrapes. 'Responsible amounts.'\"\n\nMeilin didn't deny it. \"Yes.\"\n\nVale's jaw clenched. \"If you steal from my inventory…\"\n\nMeilin finally looked at them. \"If I save your crew,\" she said, \"you'll call it theft. If I don't, you'll call it tragedy.\"\n\nVale held her gaze a long moment, then looked away, defeated by the math of it.\n\n\"Log what you take,\" Vale muttered.\n\nMeilin blinked. \"Excuse me?\"\n\nVale's voice was sour. \"If you're going to be unbearable, be unbearable with records. You take a pinch of flour, you write it down. You scrape a tin, you write it down. I won't have you turning my hold into superstition.\"\n\nMeilin's expression softened (not much, but enough to be human). \"Agreed,\" she said. \"We'll be unbearable professionally.\"\n\nVale snorted once, almost a laugh, then shoved another sack toward her.\n\nMeilin leaned in, sniffed, and felt the bitter-sweet wrongness again.\n\nAnd in that moment, something in her clicked into its final shape:\n\nThe void wasn't just a place to run.\n\nIt was a place where her methods mattered more than manners, because out here, subtle contamination didn't just make people sick.\n\nIt made ships fail.\n\nCrews die.\n\nRoutes end.\n\nMeilin wrote down the lot symbol from the sack. She traced the stamp with her thumb. She looked at Vale and saw, for the first time, not a hostile gatekeeper, but a competent foil, the kind you could build a new kind of trust with: transactional, precise, and forged under pressure.\n\n\"This,\" Meilin said quietly, tapping the symbol, \"is where we start.\"\n\nVale nodded, grim. \"And when we dock,\" they replied, \"we find who sold it.\"\n\nMeilin's eyes went bright again, the worrying kind.\n\n\"Yes,\" she said.\n\nBecause now she had proof of the thing she'd suspected back on Bral:\n\nThe easiest way to control people wasn't a blade.\n\nIt was what you fed them."
}
