{
  "number": "09",
  "title": "Smith's Coster",
  "sectionTitle": "Smith's Coster",
  "icon": "landmark",
  "pullQuote": "\"Paper burns.\"",
  "keyTakeaways": [
    "**What happens**: Meilin tries the \"proper\" route, documents the pattern, and brings it to **Smith's Coster**.",
    "**Key antagonist**: **Corvin Hale** offers resources and \"protection\" in exchange for silence and procedure-through-them.",
    "**What she learns**: Paperwork can be a weapon; leverage is administered, not shouted.",
    "**Ongoing hook**: Meilin refuses the leash, triggering quiet retaliations that squeeze her life and shop."
  ],
  "content": "Meilin didn't go to war.\n\nShe tried to file a complaint.\n\nThat was the part people never understood later. When they spoke about her like she'd been born to be hunted, they missed the point. She didn't wake up hungry for enemies. She woke up hungry for certainty, and certainty has a bad habit of walking straight through other people's profits.\n\nOn her workbench, Sera's tonic bottle sat beside three others bought from three different stalls, each wrapped in cloth, each labeled in Meilin's sharp, corrective hand. Beside them: a peeled label scrap, a shipping invoice acquired through Meredin's channels, a pinch of powder scraped from a spice tin on the *Drift-Sparrow* months ago.\n\nA small museum of ordinary objects that all tasted wrong in the same way.\n\nMeilin lined them up like a diagnostician laying out symptoms, and she started doing what her father taught her to do when the story got slippery:\n\nShe wrote it down.\n\nNot poetry. Not outrage.\n\n**Dates.**\n**Lot marks.**\n**Locations.**\n**Onset times.**\n**Shared distributors.**\n**Witness names who didn't know they were witnesses.**\n\nShe built the pattern into something hard enough to hold.\n\nShe stopped calling it \"a contamination,\" because that word implied accident.\n\nIt had a name now: **mindersand**, a pale, fine \"drying powder\" that showed up wherever people needed to be a little less difficult.\n\nAnd because she was Meilin, because her curiosity outranked comfort, she didn't stop at paper.\n\nShe tested.\n\nNot recklessly. Never recklessly. Methodically.\n\nTiny controlled doses, the way she'd learned after her public near-death. She didn't need to prove it would kill you. She needed to prove what it *did*.\n\nFog first. Then tremor. Then a subtle flattening of urgency, the body's quiet agreement to be slower, softer, less difficult.\n\n*Compliance shaped like fatigue.*\n\nShe could almost admire the design.\n\nAlmost.\n\nThe next day, she went walking.\n\nNot like a crusader. Like a shopper.\n\nShe bought tea from the stall Sera used and asked, casually, where they got their sweetener. She watched the vendor's hands, the way he reached for the jar without thinking, the way his eyes flicked toward a stamped crate with a too-respectable warehouse mark.\n\nShe went to the tonic shop and asked for a larger bottle, smiling like she'd been converted into a loyal customer. She listened for the little shifts in the clerk's tone when he named his supplier, too practiced, too ready. A lie rehearsed into comfort.\n\n\"Busy season,\" he said when she asked about deliveries.\n\nMeilin nodded, friendly. \"Of course.\"\n\nThen she asked the question that made his smile falter.\n\n\"Do you have the lot sheet?\"\n\n\"The what?\"\n\n\"The lot sheet,\" Meilin repeated, pleasantly. \"For quality. You sell something that people ingest, you keep your lot sheets.\"\n\nThe clerk blinked, then recovered. \"We don't… we don't really…\"\n\nMeilin tilted her head. \"You don't keep them… or you don't *have* them?\"\n\nA heartbeat.\n\nHe reached under the counter and produced a scrap of paper with numbers written too neatly to be casual.\n\nMeilin thanked him, paid, and left without pressing further.\n\nThat was her method: don't start a fight at the front door. Let the truth follow you outside.\n\nBy the time she returned to her shop, Meredin's network had delivered something better than rumor: a distributor name tied to both the tonic shop and three other \"health\" stalls across the docks. And, as a quiet bonus, a note from someone who worked near the warehouses:\n\n**They've been moving more sealed crates at night. Same stamp. Same coin.**\n\nMeilin stared at that line for a long time.\n\nNight shipments were where respectable companies hid their sins.\n\n---\n\nHer first attempt to handle it \"properly\" would have been laughable if it hadn't been so dangerous.\n\nShe went to a Smith's Coster office.\n\nNot with a torch. With a folder.\n\nA building that smelled of fresh varnish and clean paper, guarded by clerks with tidy hair and eyes that slid past you like you were an inconvenience. A place designed to make you feel unclean for having a body.\n\nMeilin asked for whoever handled \"quality concerns.\"\n\nShe was led into a small room with a polished table and a pitcher of water she didn't touch.\n\nA man arrived wearing respectable clothes and a smile that practiced kindness like a trade. \"Corvin Hale,\" he introduced himself, as if the name should have done the rest of the work for him.\n\n\"Miss Starwell,\" he said, as if he'd been expecting her. \"I'm told you have… questions.\"\n\nMeilin set her folder down and opened it.\n\nShe didn't accuse. She didn't rant. She showed.\n\nSamples labeled by hand. Lot marks copied carefully. Dates. Stall names. Distributor receipts.\n\nThe man's smile remained, but his eyes changed (subtle, like a lock turning).\n\n\"This is quite thorough,\" he said.\n\n\"It has to be,\" Meilin replied. \"People are getting dosed. It's subtle, but it's consistent. I want to know what you're cutting these products with.\"\n\nThe man's smile widened by a fraction. \"And you assume it's us.\"\n\nMeilin didn't blink. \"I assume nothing. I traced the supply chain. Your name is on the invoices.\"\n\nHe leaned back in his chair, fingers steepled, as if impressed despite himself. \"You understand, Miss Starwell, that many distributors use our warehouses. Our stamp doesn't mean intent.\"\n\n\"Then it should be easy for you to tell me who handled the batches,\" Meilin said. \"And to stop it.\"\n\nThe man regarded her for a long moment. Then he reached for her folder, not to take it, but to touch the edge, lightly, as if claiming the right to be near it.\n\n\"You have a sharp mind,\" he said. \"That's rare. And useful.\"\n\nMeilin's stomach tightened. \"I'm not for sale.\"\n\nHe chuckled softly, as if she'd made a charming joke. \"Everyone is,\" he said. \"The only question is whether you're paid in coin or… circumstances.\"\n\nMeilin's voice went colder. \"Is that a threat?\"\n\n\"It's a kindness,\" he replied smoothly. \"You could bring this to inspectors. You could make noise. And then you'd discover how unpleasant it is to be noisy on the Rock of Bral.\"\n\nHe slid a small envelope across the table.\n\nA contract. Clean paper. Heavy promise.\n\n\"Work with us,\" he said. \"Officially. Excellent pay. Resources. Protection. You can ensure quality across a wide network. You can do real good, Miss Starwell, without putting yourself in danger.\"\n\nMeilin looked at the envelope as if it were a jar of poison with good marketing.\n\nCorvin Hale didn't push it at her. He didn't have to. The room did the pushing for him: the polished table that never saw blood, the clean water she wouldn't drink, the quiet certainty that paperwork could be sharper than blades.\n\n\"You don't like the word 'leash,'\" Hale said mildly. \"Fine. Call it a *position*.\"\n\nMeilin's gaze stayed flat. \"And what do you want?\"\n\nHale's smile didn't change. \"Silence,\" he said, as if naming an ingredient. \"Or, if you can't manage silence, then at least… procedure. You submit findings through proper channels. You stop buying samples off dock tables. You stop making the docks nervous.\"\n\n\"You mean,\" Meilin said, \"I stop being independent.\"\n\nHale's eyes flicked (barely). \"I mean you stop being *exposed*.\"\n\nMeilin didn't touch the contract. \"And if I refuse your protection?\"\n\nHale's voice stayed gentle, which was the point. \"Then the world becomes less convenient for you,\" he said. \"A supplier decides you're 'difficult.' A landlord remembers a clause. A dock inspector finds the time to be thorough. A clinic 'misplaces' a referral. None of it is personal. It's just… administration.\"\n\nAdministration. The word wore a smile like a mask.\n\n\"You want a leash,\" she said.\n\nHis smile did not move. \"I want to prevent misunderstandings.\"\n\nMeilin closed her folder. \"No.\"\n\nThe room cooled.\n\nFor the first time, the man's eyes showed something real: annoyance, perhaps, or a calculation changing shape.\n\n\"You're making this difficult,\" he said.\n\nMeilin stood. \"I'm making it documented.\"\n\nHis voice stayed gentle. \"Think carefully. The docks can become very small for people who refuse reasonable arrangements.\"\n\nMeilin looked him in the eye. \"Then you should have thought carefully before you started dosing people who can't afford to notice.\"\n\nShe walked out with her folder still in her hands.\n\nAnd that was when the city began to shrink."
}
