{
  "number": "05",
  "title": "Pattern-hunter",
  "sectionTitle": "The Pattern-Hunter",
  "icon": "search",
  "pullQuote": "\"Maps lead places. Some places don't like visitors.\"",
  "keyTakeaways": [
    "**What happens**: Hask brings a list of sources/marks; Meilin recognizes it as a map.",
    "**What she learns**: Treat cases as connected events: symptoms link to routes, vendors, seals, and handling.",
    "**New toolkit**: \"Galley forensics\" starts here: scraping seams, tracking lots, following residue instead of rumors.",
    "**Ongoing hook**: Being right starts to cost more; \"help\" arrives as paperwork, courtesy, and tightening pressure."
  ],
  "content": "After the near-death, the docks treated Meilin differently.\n\nNot gently. Bral didn't do gentle. But *carefully*, the way people handle a blade they've seen cut clean through bone. They watched her when she passed. They lowered their voices when they spoke about \"that day.\" Some looked guilty, like they'd been the ones to push the cup into her hands. Others looked offended, like her body's betrayal had been a personal inconvenience.\n\nThe tea vendor (Hask, his name was Hask, which Meilin hadn't known until she'd nearly died in front of him) showed up at her father's shop two mornings later with a rolled scrap of paper and an expression like a man bringing a confession. Kaito Starwell watched him come in like he was reading weather.\n\n\"I wrote it down,\" he said, holding it out with both hands. \"Everything. Where I bought it. Who sold it. Which dock it came through.\"\n\nMeilin took the paper and smoothed it flat on the counter.\n\nIt was a simple list. Not dramatic. Not damning.\n\nAnd yet she could feel the world tilt around it.\n\nNames of stalls. A warehouse mark. A porter's shorthand. A few lot symbols that meant nothing to most people and everything to someone trained to notice.\n\nHer father glanced at it and gave a small grunt that meant *good* and *dangerous* in the same breath.\n\nMeilin didn't look up. \"Thank you,\" she said, because it was true.\n\nHask's eyes were red-rimmed. \"You… you said it wasn't my fault.\"\n\n\"It wasn't,\" Meilin replied. She tapped the list with an ink-stained finger. \"But this is where it becomes someone's fault.\"\n\nHer eyes lingered on the warehouse mark and the porter's shorthand. A stall didn't need to *add* mindersand to carry it. It only needed to buy sweetener or \"improver\" stock that had sat too close to the wrong crates, handled by the same hands, poured through the same funnels, dust clinging to seams the way it clung to everything on the docks.\n\nHask flinched like he'd been slapped.\n\nMeilin softened, just slightly. \"Not yours,\" she added. \"You did the right thing. Don't stop doing that.\"\n\nHask nodded and left like he'd been allowed to keep breathing.\n\nWhen the door shut, her father said quietly, \"You understand what you're holding?\"\n\n\"A map,\" Meilin said.\n\nHe watched her a long moment. \"Maps lead places,\" he said. \"Some places don't like visitors.\"\n\nMeilin's mouth twitched. \"Then I'll knock quietly.\"\n\nThat was the beginning of the habit.\n\nNot the tasting. Not the notes. Those were already in her bones.\n\nThe habit was this: **she stopped treating cases as isolated events.** She started treating them as *connected*.\n\nA cough wasn't just a cough. It was a berth number. A water barrel. A vendor stall. A spice sack that passed through three hands before it hit a pot.\n\nA rash wasn't just a rash. It was who handled the rope tar. Which dock had the new shipment of lamp oil. Whether the itching started after work or after dinner.\n\nMeilin began to build her own ledger, not of money, but of *movements*.\n\nShe made friends in the places polite people ignored.\n\nA cooper who could tell by smell when a barrel had been treated with the wrong resin.\nA tired dock runner who knew which carts always rolled after midnight.\nA galley cook who complained about \"bad flour\" like it was an insult to her ancestors.\n\nShe listened with the same calm attention she gave fevers. She asked questions that turned small gripes into timelines.\n\nAnd because she had publicly forgiven Hask, because she'd refused the crowd its villain, people stopped fearing her in one particular way.\n\nThey still feared her competence, sure. But they didn't fear that she was cruel.\n\nSo they spoke.\n\nThey told her things they wouldn't have told a clinic clerk with a crisp collar and a clean quill.\n\nA deckhand came in with shaking hands and said, \"It's nothing,\" and Meilin replied, \"Nothing doesn't have a schedule. Tell me when it happens.\"\nA porter's wife whispered, \"He's sleeping all day,\" and Meilin asked, \"What's he drinking on shift?\"\nA cook hissed, \"Someone's been in my spice drawer,\" and Meilin said, \"Show me what moved.\"\n\nThat last one should have been a joke.\n\nIt wasn't.\n\nMeilin began to see the galley the way her father had taught her to see bodies: not as comfort, but as evidence.\n\nShe started carrying little cloth-wrapped vials that didn't clink. A pinch of chalk for marking. A bit of vinegar for testing residues. A strip of wax paper for scraping samples without contaminating them with her own hands.\n\nShe stopped looking for certainty in \"proof\" the way polite people meant it. She trusted her own senses (trained, repeatable). The faint wrongness in a tin's smell. The way powder clung. The bitter-metal ghost behind sweetness. And when her tongue couldn't answer alone, she let the pattern answer: who bought what, from where, and who got sick afterward.\n\nIt made her insufferable at dinners.\n\nIt made her *right*.\n\nAnd being right started to cost more.\n\nAt first, the consequences were small and stupid: offended hosts, annoyed cooks, merchants who suddenly \"ran out\" of stock the moment she asked too many questions.\n\nThen the consequences developed teeth.\n\nA supplier who used to smile at her father began to avoid eye contact when Meilin approached. A familiar vendor shut his stall early, citing \"inventory troubles.\" A minor dock inspector started showing up near their shop more often, lingering too long, looking at nothing in particular.\n\nOne afternoon, a clerk with tidy handwriting and a cleaner cloak stepped into the shop and offered Meilin a \"professional courtesy\": a stamped paper that would make certain purchases easier, make certain inspections smoother.\n\nIt was the kind of thing that sounded like help and tasted like ownership.\n\nMeilin didn't take it.\n\nHer father watched her refusal with the same expression he used when she mixed a salve correctly: not pride, exactly, more like grim confirmation.\n\nThat night, Meilin pinned Hask's list to the wall and began adding to it.\n\nNot with grand declarations. With small, careful marks.\n\nA lot symbol she'd seen twice in two weeks.\nA warehouse stamp that reappeared whenever someone complained of \"fatigue\" that didn't match their sleep.\nA cart route that always passed the same corner before stopping at the same two stalls.\nA name, noted once, then again, then again.\n\nShe didn't call it a conspiracy.\n\nShe called it a pattern.\n\nAnd patterns, in her experience, were simply the shape of truth people hoped you wouldn't notice.\n\nIn the quiet hours, when the docks hummed like a sleeping beast, Meilin sat with her inkstone and her notes and felt something settle into place inside her, something that would never leave.\n\nShe was no longer just learning medicine.\n\nShe was learning **supply**.\n\nAnd supply (she was starting to understand) was where you could hurt a hundred people without ever lifting a blade.\n\nShe ran a finger over the growing web of marks on the wall and whispered, not as a vow but as a diagnosis:\n\n\"Someone's doing this on purpose.\"\n\nThen she dipped her pen.\n\nAnd wrote down the next name."
}
