{
  "number": "06",
  "title": "Meredin",
  "sectionTitle": "Meredin's Patronage",
  "icon": "handshake",
  "pullQuote": "\"Being useful is a kind of target.\"",
  "keyTakeaways": [
    "**What happens**: Off-books patients start arriving with \"pay later —M\" notes; the name **Meredin Sandyfoot** keeps surfacing.",
    "**What Meilin learns**: In the Burrows, protection looks like *coverage*: doors opening, trouble redirected, no official paper.",
    "**Key relationship**: Meilin meets Meredin (no romance, no ownership); a mutual reliance on reliability and discretion.",
    "**Ongoing hook**: Meredin routes vulnerable people to Meilin and quietly blunts pressures that would otherwise crush her shop."
  ],
  "content": "Meredin Sandyfoot didn't arrive like a patron.\n\nThere was no dramatic entrance, no entourage, no gleaming signet ring flashed as proof of importance. The first time Meilin heard the name, it came out of a dockhand's mouth the way sailors spoke of weather: practical, respectful, and edged with warning.\n\n\"You want this to stay quiet,\" the dockhand said, hovering in the doorway with his cap twisting in his hands. \"You take it to Meredin.\"\n\nMeilin looked up from grinding dried root. \"And who's Meredin?\"\n\nThe dockhand hesitated, as if saying it aloud might summon trouble. \"Someone who keeps the Burrows from eating itself.\"\n\nThat was a strange description, but Meilin had learned to trust strange descriptions. They were usually truer than neat ones.\n\nIt wasn't Meredin who came first. It was Meredin's work.\n\nA girl (twelve, maybe thirteen) was brought in late one night by a woman with a knife scar along her jaw and exhaustion in her eyes. The girl's skin was too pale, her lips a touch blue, her breath shallow like she was trying not to take up space.\n\n\"She can't go to the clinics,\" the woman said quickly. \"They'll ask questions.\"\n\nMeilin's father, Kaito Starwell, glanced at Meilin, then at the girl. \"Questions about what?\"\n\nThe woman's jaw tightened. \"About why she's alone. About who she belongs to.\"\n\nMeilin's hand stilled over the mortar.\n\nHer father said, simply, \"Put her on the table.\"\n\nAs Meilin worked (listening, testing, measuring), she realized the girl wasn't cursed, wasn't possessed, wasn't anything the dock gossips would have made poetic.\n\nShe was starved.\n\nNot of food. Of *safety*. Of consistency. Of the kind of sleep that lets the body stop bracing for the next blow.\n\nMeilin treated the symptoms anyway, because that's what you did when you couldn't treat the world.\n\nWhen the girl finally slept, the woman with the scar leaned on the counter and exhaled like she'd been holding her breath for a month.\n\n\"You didn't ask,\" she said.\n\nMeilin wiped her hands. \"Ask what?\"\n\n\"Who we are,\" the woman said. \"What we did. Why we can't go anywhere official.\"\n\nMeilin's mouth tightened. \"If you needed me to judge you, you'd have gone somewhere with cleaner floors.\"\n\nThe woman stared at her for a long moment. Then she laughed once (sharp, surprised). \"All right,\" she said. \"Meredin was right about you.\"\n\nMeilin felt her father's eyes shift, subtle, attentive.\n\n\"Meredin?\" her father asked.\n\nThe woman nodded. \"Sandyfoot. They said you'd help without turning it into a sermon.\"\n\nMeilin's father didn't react the way people reacted to big names. He just said, \"Who sent you?\"\n\nThe woman hesitated, then pulled a folded scrap of paper from her pocket. No seal. No crest. Just a line of tidy handwriting:\n\n**For the girl. Pay later. —M**\n\nIt wasn't money. It was an *introduction*.\n\nMeilin read it, then looked up. \"So Meredin collects debts.\"\n\nThe woman's gaze was steady. \"Meredin remembers favors.\"\n\nThat was the first time Meilin understood what protection looked like in the Burrows.\n\nNot guards at your door.\n\nNot official papers.\n\nJust… *doors that opened* when they should have stayed shut. People who didn't ask your name when they should have. A whisper that made trouble drift elsewhere, like smoke redirected by a hand you couldn't see.\n\nOver the next months, the pattern repeated.\n\nA stevedore who \"fell\" and broke two fingers, except the bruises on his arm said he'd been held down.\nA messenger with a fever who insisted it was \"nothing\" because \"they can't have me missing work.\"\nA dock cook with a cough that smelled faintly of sweetener and rot.\n\nThey came in with the same quiet urgency and the same careful distance from anything official. And always, somewhere in the story, the same name floated like a low tide mark: Meredin.\n\nMeilin met Meredin Sandyfoot at last in a place that wasn't a throne room and wasn't a tavern.\n\nIt was a narrow space between two warehouses where the air smelled of damp canvas and stored grain. A spot people used for quick conversations because nobody lingered there unless they had to.\n\nMeredin was smaller than Meilin expected: compact, grounded, built like someone who'd learned to take up only the space they needed. Their eyes were the notable part: not warm, not cruel, just awake in a way that suggested they counted everything.\n\nThey didn't greet Meilin like a savior or a tool. They greeted her like a craftsman meeting another craftsman.\n\n\"Starwell,\" Meredin said. Not *Mei-mei*. Not a nickname. The name as it appeared on paper.\n\nMeilin's fingers tightened around her satchel strap. \"Sandyfoot.\"\n\nMeredin's mouth twitched at the formality. \"You're careful.\"\n\n\"I'm alive,\" Meilin replied.\n\nMeredin nodded once, as if that answered a question they'd been carrying. \"I heard you forgave Hask.\"\n\nMeilin blinked. \"Everyone heard.\"\n\n\"Not everyone approved,\" Meredin said.\n\nMeilin snorted softly. \"Crowds like villains.\"\n\n\"And you refused to give them one,\" Meredin said. \"That makes you harder to steer.\"\n\nMeilin's eyes narrowed. \"Is this the part where you tell me what you want?\"\n\nMeredin didn't flinch. \"I want you to keep doing what you're doing.\"\n\n\"That's a bad investment,\" Meilin said. \"I make people angry.\"\n\nMeredin's gaze stayed steady. \"You make the right people angry.\"\n\nMeilin let that land. The damp air. The distant thump of cargo. The feeling of being assessed.\n\n\"And what do you get?\" Meilin asked.\n\nMeredin's answer was immediate. \"Fewer funerals.\"\n\nThat was the first thing Meredin said that sounded almost like sentiment.\n\nAlmost.\n\nThen they continued, businesslike again: \"The clinics are political. The docks are vulnerable. People get sick and they can't afford to be seen sick. You treat them. Quietly. Efficiently.\"\n\nMeilin tilted her head. \"And when someone comes looking for me?\"\n\nMeredin's eyes flicked, just once, toward the mouth of the alley, where a pair of dock-watchmen passed without looking in.\n\n\"They won't find you,\" Meredin said. \"Not easily.\"\n\nMeilin felt a cold certainty settle in her stomach. \"So it's protection.\"\n\n\"It's coverage,\" Meredin corrected, like the distinction mattered. \"I don't own you.\"\n\n\"I don't belong to anyone,\" Meilin said, sharply enough that it surprised her.\n\nMeredin held up a hand, palm out, calm. \"Good. I don't need ownership. I need reliability.\"\n\nMeilin exhaled slowly. \"Reliability costs.\"\n\n\"Yes,\" Meredin agreed. \"So does being alone.\"\n\nThat was how Meredin worked: no promises they couldn't keep, no romance, no speeches. Just a practical triangle of needs.\n\nThey routed patients to Meilin who couldn't go anywhere else.\nMeilin kept those people functional, alive, working, breathing.\nAnd in return, Meredin made sure the little pressures that had begun to gather around Meilin's shop (\"random\" inspections, missing shipments, sudden shortages) didn't quite land.\n\nNot because Meredin could stop them.\n\nBecause Meredin could *redirect* them.\n\nA dock inspector arrived with questions and found himself urgently needed elsewhere.\nA supplier who'd \"run out\" of stock suddenly found a crate \"miscounted\" in his own ledger and decided, sheepishly, that yes, he did have what Meilin needed after all.\nA rough-looking man who lingered too long outside the shop got gently, firmly steered into a different alley by people who didn't wear uniforms.\n\nMeilin didn't ask how. She was learning the rules of this arrangement: you didn't demand to see the gears if you wanted the machine to keep running.\n\nThe real cost came in the favors.\n\nThey weren't asked for with threats. That was the clever part. They were asked for like necessities.\n\nMeredin's runner, Nori, would appear at the door with a tired expression and a polite tone.\n\n\"Meredin's asking,\" the runner would say, \"if you can look at someone. Off-books.\"\n\nMeilin would say yes.\n\nNot because she liked being used. She hated the implication. But she'd seen what happened to people who were \"off-books\" and untreated.\n\nSometimes the patient was a laborer who'd taken a bad fall and needed their ribs wrapped well enough to keep working. Sometimes it was a kid with shaking hands and a too-fast heart. Sometimes it was a courier whose \"fatigue\" smelled faintly, unmistakably, of something cut into their tea.\n\nMeilin would treat them.\n\nAnd Meredin would remember.\n\nOne evening, after a long day of cases, Meilin found her father sitting with his notebook open, but not writing. His eyes looked older than they had a year ago.\n\n\"You're in deep,\" he said without looking up.\n\nMeilin set down her satchel. \"I'm useful.\"\n\nHer father's pen hovered. \"Useful is a kind of target.\"\n\nMeilin's jaw tightened. \"So is being right.\"\n\nHer father finally looked at her. \"And that's the danger. You're becoming right in ways that touch money.\"\n\nMeilin thought of her wall of marks. Of lot symbols repeating. Of certain shipments that always preceded certain symptoms.\n\n\"I'm not trying to start a fight,\" she said quietly.\n\nHer father's expression softened by a fraction. \"No,\" he agreed. \"That's why it's worse. People forgive fights. They don't forgive diagnoses.\"\n\nMeilin went to her wall and traced the newest line she'd drawn between a warehouse mark and a name she'd seen too often in dock gossip. She didn't say it out loud.\n\nNot yet.\n\nBut she felt the edge of it.\n\nThe city was starting to notice she noticed.\n\nAnd now, thanks to Meredin, she had coverage.\n\nWhich meant she also had **a stake**.\n\nBecause if she fell, it wouldn't just be her.\n\nIt would be all the people who'd been able to come to her without getting eaten alive by \"official\" questions.\n\nMeilin stared at the web of marks and felt the web tighten back, invisible around her ribs.\n\nProtection was real.\n\nSo were obligations.\n\nAnd somewhere out there, beyond the polite clinics and the public docks, someone would eventually decide that both were inconvenient."
}
